DesafioBeClever/app/Models/RegistroModel.php

		public function buscarXFechas($fechaDesde, $fechaHasta){
			//Conexión con la base de datos
			$bd = \Config\Database::connect();
			$tabla = $bd->table('registros r');

        	//Transformo las fechas a string para usarlas en la consulta
			$fechaDesde = $fechaDesde->format('Y-m-d');
			$fechaHasta = $fechaHasta->format('Y-m-d');

        	//Funciones para realizar el inner join
			$tabla->select('e.Sexo, r.Fecha, s.Sucursal');
			$tabla->join('empleados e', 'r.CodigoEmpleado = e.Codigo');
			$tabla->join('sucursales s', 'e.CodigoSucursal = s.Codigo');
			$tabla->where('r.Fecha >=', $fechaDesde); //"BETWEEN"
			$tabla->where('r.Fecha <=', $fechaHasta);
			$consulta = $tabla->get()->getResultArray();
---
SELECT `e`.`Sexo`, `r`.`Fecha`, `s`.`Sucursal`
FROM `empleados` `e`
JOIN `registros` `r` ON `r`.`CodigoEmpleado` = `e`.`Codigo`
JOIN `sucursales` `s` ON `e`.`CodigoSucursal` = `s`.`Codigo`
WHERE `r`.`Fecha` >= '2023-03-25'
AND `r`.`Fecha` <= '2023-05-26'
SELECT `e`.`Sexo`, `r`.`Fecha`, `s`.`Sucursal`
FROM `registros` `r`
JOIN `empleados` `e` ON `r`.`CodigoEmpleado` = `e`.`Codigo`
JOIN `sucursales` `s` ON `e`.`CodigoSucursal` = `s`.`Codigo`
WHERE `r`.`Fecha` >= '2023-03-25'
AND `r`.`Fecha` <= '2023-05-26'