DesafioBeClever/app/Controllers/restEmpleado.php

INSERT INTO `registros` (`CodigoEmpleado`, `Fecha`, `CodigoTipoRegistro`) VALUES ('1', '2021-02-11', '1')
---
                        'CodigoTipoRegistro'=>$CodigoTipoRegistro
                    );

                    $id = $registro->insert($datos);

SELECT *
FROM `tiporegistros`
---
    private function tipoRegistro($registro){
        $tipos = new TipoRegistroModel();
        $tipos = $tipos->findAll();